---
kind: other
id: Methods.T:Autodesk.Revit.DB.SweepProfile
source: html/53f434f3-0775-e94d-f1a2-31c8827b1705.htm
---
# SweepProfile Methods

Causes the object to release immediately any resources it may be utilizing.